
> n
 *** Room 1.before: action is Go/24 noun=5 (north)
     consult 0/0 (going 4102, notustood 4100)
 *** Room 2.before: action is <fake action 6>/4102 noun=5 (north)
     consult 0/0 (going 4102, notustood 4100)
 *** Room 1.after: action is <fake action 6>/4102 noun=5 (north)
     consult 0/0 (going 4102, notustood 4100)
 *** Room 2.after: action is Go/24 noun=5 (north)
     consult 0/0 (going 4102, notustood 4100)
Darkness
It is pitch dark here!
 *** Room 2.after: action is Look/30 noun=5 (north)
     consult 0/0 (going 4102, notustood 4100)

> jhn, hello
I can't see who you are referring to.

> john, hello
I can't see who you are referring to.

> s
 *** Room 2.before: action is Go/24 noun=5 (south)
     consult 0/0 (going 4102, notustood 4100)
 *** Room 1.before: action is <fake action 6>/4102 noun=5 (south)
     consult 0/0 (going 4102, notustood 4100)
 *** Room 1.after: action is <fake action 6>/4102 noun=5 (south)
     consult 0/0 (going 4102, notustood 4100)
 *** Room 1.after: action is Go/24 noun=5 (south)
     consult 0/0 (going 4102, notustood 4100)
Room 1

You can see a red cube, a black cube and John here.
 *** Room 1.after: action is Look/30 noun=5 (south)
     consult 0/0 (going 4102, notustood 4100)

> jhn, hello
I can't see who you are referring to.

> john, hello
 *** John.orders: action is <fake action 4>/4100 second=12 (John)
     consult 3/1 (going 4102, notustood 4100)
 *** Room 1.before: action is Answer/2 second=12 (John)
     consult 3/1 (going 4102, notustood 4100)
 *** John.life: action is Answer/2 second=12 (John)
     consult 3/1 (going 4102, notustood 4100)
There is no reply.

> john, open xyzzy
 *** John.orders: action is <fake action 4>/4100 noun= ('open') second=12 (John)
     consult 3/2 (going 4102, notustood 4100)
 *** Room 1.before: action is Answer/2 noun= ('open') second=12 (John)
     consult 3/2 (going 4102, notustood 4100)
 *** John.life: action is Answer/2 noun= ('open') second=12 (John)
     consult 3/2 (going 4102, notustood 4100)
There is no reply.

> john, open in on
 *** John.orders: action is <fake action 4>/4100 noun=5 (in) second=12 (John)
     consult 3/3 (going 4102, notustood 4100)
 *** Room 1.before: action is Answer/2 noun=5 (in) second=12 (John)
     consult 3/3 (going 4102, notustood 4100)
 *** John.life: action is Answer/2 noun=5 (in) second=12 (John)
     consult 3/3 (going 4102, notustood 4100)
There is no reply.

> john, get cube
You need to be more specific.

> john, get red cube
 *** John.orders: action is Take/20 noun=10 (red cube)
     consult 0/0 (going 4102, notustood 4100)
 *** John.life: action is Take/20 noun=10 (red cube)
     consult 0/0 (going 4102, notustood 4100)
John has better things to do.

> john, examine gun
 *** John.orders: action is Examine/18 noun=13 (gun)
     consult 0/0 (going 4102, notustood 4100)
 *** John.life: action is Examine/18 noun=13 (gun)
     consult 0/0 (going 4102, notustood 4100)
John has better things to do.

> john, help me
 *** John.orders: action is <fake action 4>/4100 second=12 (John)
     consult 3/2 (going 4102, notustood 4100)
 *** Room 1.before: action is Answer/2 second=12 (John)
     consult 3/2 (going 4102, notustood 4100)
 *** John.life: action is Answer/2 second=12 (John)
     consult 3/2 (going 4102, notustood 4100)
There is no reply.

> john, say dragon master to me
 *** John.orders: action is Answer/2 second=6 (yourself)
     consult 4/2 (going 4102, notustood 4100)
 *** John.life: action is Answer/2 second=6 (yourself)
     consult 4/2 (going 4102, notustood 4100)
John has better things to do.

> examine gun
You can't see any such thing.

> quit
Are you sure you want to quit? yes

